services/worker/openfoam/case_template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| Linear solvers + PIMPLE controls.                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;      // tight on the final corrector — WSS is a
                                // gradient and inherits pressure error
    }

    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors            2;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
    pRefCell                    0;
    pRefValue                   0;

    residualControl
    {
        U { tolerance 1e-5; relTol 0; }
        p { tolerance 1e-5; relTol 0; }
    }
}

relaxationFactors
{
    equations
    {
        ".*"    1;      // transient PIMPLE: no under-relaxation
    }
}

// ************************************************************************* //
