services/worker/openfoam/case_template/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| Mesh quality limits for snappyHexMesh.                                       |
| These are the standard OpenFOAM values; the gate thresholds we actually      |
| report on are checked separately by the meshqc stage:                        |
|   max non-orthogonality < 65, max skewness < 4, layer coverage > 60%.        |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxNonOrtho             65;
maxBoundarySkewness     20;
maxInternalSkewness     4;
maxConcave              80;
minVol                  1e-13;
minTetQuality           1e-15;
minArea                 -1;
minTwist                0.02;
minDeterminant          0.001;
minFaceWeight           0.05;
minVolRatio             0.01;
minTriangleTwist        -1;

nSmoothScale            4;
errorReduction          0.75;

relaxed
{
    maxNonOrtho         75;
}

// ************************************************************************* //
